STMicroelectronics/STM32DDRFW-UTIL/Drivers/BSP/STM32MP257F-DK/stm32mp257f_disco_camera.c
/** @defgroup _Variables Exported Variables
  * @{
  */
CAMERA_Ctx_t        CameraCtx[CAMERA_INSTANCES_NBR];

CAMERA_Capabilities_t Cap;

/** @defgroup CAMERA_Private_Variables Private Variables
  * @{
  */
static CAMERA_Drv_t *CameraDrv = NULL;
static void         *CompObj = NULL;
static CAMERA_Capabilities_t *CameraCap;
/**
  * @}
  */

/** @defgroup CAMERA_Private_FunctionsPrototypes Private Functions Prototypes
  * @{
  */
#if defined(USE_CAMERA_SENSOR_OV5640)
OV5640_Object_t   OV5640Obj = { 0 };
static int32_t OV5640_Probe(uint32_t Resolution, uint32_t PixelFormat);
#elif defined (USE_CAMERA_SENSOR_IMX219)
IMX219_Object_t   IMX219Obj = { 0 };
static int32_t IMX219_Probe(uint32_t Resolution, uint32_t PixelFormat);
#elif defined (USE_CAMERA_SENSOR_IMX335)
IMX335_Object_t   IMX335Obj = { 0 };
static int32_t IMX335_Probe(uint32_t Resolution, uint32_t PixelFormat);
#endif /* USE_CAMERA_SENSOR_OV5640 */

/**
  * @}
  */

/** @addtogroup CAMERA_Exported_Functions

  * @{
  */
/**
  * @brief  Initializes the camera.
  * @param  Instance    Camera instance.
  * @param  Resolution  Camera sensor requested resolution (x, y) : standard resolution
  *         naming QQVGA, QVGA, VGA ...
  * @param  PixelFormat Capture pixel format
  * @retval BSP status
  */
int32_t BSP_CAMERA_Init(uint32_t Instance, uint32_t Resolution, uint32_t PixelFormat)
{
  int32_t ret;

  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    return BSP_ERROR_WRONG_PARAM;
  }

  if (BSP_CAMERA_HwReset(0) != BSP_ERROR_NONE)
  {
    return BSP_ERROR_BUS_FAILURE;
  }

  /* Read ID of Camera module via I2C */
#if defined(USE_CAMERA_SENSOR_OV5640)
  ret = OV5640_Probe(Resolution, PixelFormat);
#elif defined(USE_CAMERA_SENSOR_IMX219)
  ret = IMX219_Probe(Resolution, PixelFormat);
#elif defined(USE_CAMERA_SENSOR_IMX335)
  ret = IMX335_Probe(Resolution, PixelFormat);
#endif /* USE_CAMERA_SENSOR_OV5640 */
  if (ret != BSP_ERROR_NONE)
  {
    return BSP_ERROR_UNKNOWN_COMPONENT;
  }

  CameraCtx[Instance].Resolution = Resolution;
  CameraCtx[Instance].PixelFormat = PixelFormat;

  /* BSP status */
  return BSP_ERROR_NONE;
}

/**
  * @brief  DeInitializes the camera.
  * @param  Instance Camera instance.
  * @retval BSP status
  */
int32_t BSP_CAMERA_DeInit(uint32_t Instance)
{
  int32_t ret;

  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    return BSP_ERROR_WRONG_PARAM;
  }

  /* First stop the camera to insure all data are transfered */
  ret = BSP_CAMERA_Stop(Instance);
  if (ret != BSP_ERROR_NONE)
  {
    return BSP_ERROR_PERIPH_FAILURE;
  }

  /* Return BSP status */
  return BSP_ERROR_NONE;
}

/**
  * @brief  Starts the camera capture in continuous mode.
  * @param  Instance Camera instance.
  * @param  CaptureMode CAMERA_MODE_CONTINUOUS or CAMERA_MODE_SNAPSHOT
  * @param  pBff     pointer to the camera output buffer
  */
int32_t BSP_CAMERA_Start(uint32_t Instance, uint8_t *pBff, uint32_t Mode)
{
  UNUSED(pBff);
  UNUSED(Mode);

  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    return BSP_ERROR_WRONG_PARAM;
  }

  return BSP_ERROR_FEATURE_NOT_SUPPORTED;
}

/**
  * @brief  Stop the CAMERA capture
  * @param  Instance Camera instance.
  * @retval BSP status
  */
int32_t BSP_CAMERA_Stop(uint32_t Instance)
{
  int ret;

  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    return BSP_ERROR_WRONG_PARAM;
  }

#if defined(USE_CAMERA_SENSOR_OV5640)
  CameraDrv = (CAMERA_Drv_t *) &OV5640_CAMERA_Driver;
  CompObj = &OV5640Obj;

  ret = CameraDrv->DeInit(CompObj);
  if (ret != OV5640_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }
  CompObj = NULL;
#elif defined(USE_CAMERA_SENSOR_IMX219)
  CameraDrv = (CAMERA_Drv_t *) &IMX219_CAMERA_Driver;
  CompObj = &IMX219Obj;
  ret = CameraDrv->DeInit(CompObj);
  if (ret != IMX219_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }
  CompObj = NULL;
#elif defined(USE_CAMERA_SENSOR_IMX335)
  CameraDrv = (CAMERA_Drv_t *) &IMX335_CAMERA_Driver;
  CompObj = &IMX335Obj;
  ret = CameraDrv->DeInit(CompObj);
  if (ret != IMX335_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }
  CompObj = NULL;
#endif /* USE_CAMERA_SENSOR_OV5640 */

  return BSP_ERROR_NONE;
}

/**
  * @brief Suspend the CAMERA capture
  * @param  Instance Camera instance.
  */
int32_t BSP_CAMERA_Suspend(uint32_t Instance)
{
  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    return BSP_ERROR_WRONG_PARAM;
  }

  return BSP_ERROR_FEATURE_NOT_SUPPORTED;
}

/**
  * @brief Resume the CAMERA capture
  * @param  Instance Camera instance.
  */
int32_t BSP_CAMERA_Resume(uint32_t Instance)
{
  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    return BSP_ERROR_WRONG_PARAM;
  }

  return BSP_ERROR_FEATURE_NOT_SUPPORTED;
}

/**
  * @brief  Get the Camera Capabilities.
  * @param  Instance  Camera instance.
  * @param  Capabilities  pointer to camera Capabilities
  * @note   This function should be called after the init. This to get Capabilities
  *         from the right camera sensor(OV5640)
  * @retval Component status
  */
int32_t BSP_CAMERA_GetCapabilities(uint32_t Instance, CAMERA_Capabilities_t *Capabilities)
{
  int32_t ret;

  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    return BSP_ERROR_WRONG_PARAM;
  }

  ret = CameraDrv->GetCapabilities(CompObj, Capabilities);
  if (ret < 0)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  return BSP_ERROR_NONE;
}

/**
  * @brief  Set the camera pixel format.
  * @param  Instance  Camera instance.
  * @param  PixelFormat pixel format to be configured
  * @retval BSP status
  */
int32_t BSP_CAMERA_SetPixelFormat(uint32_t Instance, uint32_t PixelFormat)
{
  int32_t ret;

  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    return BSP_ERROR_WRONG_PARAM;
  }

  ret = CameraDrv->SetPixelFormat(CompObj, PixelFormat);
  if (ret < 0)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  CameraCtx[Instance].PixelFormat = PixelFormat;
  return BSP_ERROR_NONE;
}

/**
  * @brief  Get the camera pixel format.
  * @param  Instance  Camera instance.
  * @param  PixelFormat pixel format to be returned
  * @retval BSP status
  */
int32_t BSP_CAMERA_GetPixelFormat(uint32_t Instance, uint32_t *PixelFormat)
{
  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    return BSP_ERROR_WRONG_PARAM;
  }

