STMicroelectronics/STM32DDRFW-UTIL/Drivers/BSP/STM32MP257F-DK/stm32mp257f_disco_camera.c
  ret = CameraDrv->SetHueDegree(CompObj, HueDegree);
  if (ret < 0)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  CameraCtx[Instance].HueDegree = HueDegree;
  return BSP_ERROR_NONE;
}

/**
  * @brief  Get the camera Hue Degree.
  * @param  Instance   Camera instance.
  * @param  HueDegree  Hue Degree
  * @retval BSP status
  */
int32_t BSP_CAMERA_GetHueDegree(uint32_t Instance, int32_t *HueDegree)
{
  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    return BSP_ERROR_WRONG_PARAM;
  }

  if (CameraCap->HueDegree == 0U)
  {
    return BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }

  *HueDegree = CameraCtx[Instance].HueDegree;
  return BSP_ERROR_NONE;
}

/**
  * @brief  Set the camera Mirror/Flip.
  * @param  Instance  Camera instance.
  * @param  MirrorFlip CAMERA_MIRRORFLIP_NONE or any combination of
  *                    CAMERA_MIRRORFLIP_FLIP and CAMERA_MIRRORFLIP_MIRROR
  * @retval BSP status
  */
int32_t BSP_CAMERA_SetMirrorFlip(uint32_t Instance, uint32_t MirrorFlip)
{
  int32_t ret;

  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    return BSP_ERROR_WRONG_PARAM;
  }

  if (CameraCap->MirrorFlip == 0U)
  {
    return BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }

  ret = CameraDrv->MirrorFlipConfig(CompObj, MirrorFlip);
  if (ret < 0)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  CameraCtx[Instance].MirrorFlip = MirrorFlip;
  return BSP_ERROR_NONE;
}

/**
  * @brief  Get the camera Mirror/Flip.
  * @param  Instance   Camera instance.
  * @param  MirrorFlip Mirror/Flip config
  * @retval BSP status
  */
int32_t BSP_CAMERA_GetMirrorFlip(uint32_t Instance, uint32_t *MirrorFlip)
{
  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    return BSP_ERROR_WRONG_PARAM;
  }

  if (CameraCap->MirrorFlip == 0U)
  {
    return BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }

  *MirrorFlip = CameraCtx[Instance].MirrorFlip;
  return BSP_ERROR_NONE;
}

/**
  * @brief  Set the camera zoom
  * @param  Instance Camera instance.
  * @param  Zoom     Zoom to be configured
  * @retval BSP status
  */
int32_t BSP_CAMERA_SetZoom(uint32_t Instance, uint32_t Zoom)
{
  int32_t ret;

  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    return BSP_ERROR_WRONG_PARAM;
  }

  if (CameraCap->Zoom == 0U)
  {
    return BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }

  ret = CameraDrv->ZoomConfig(CompObj, Zoom);
  if (ret < 0)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  CameraCtx[Instance].Zoom = Zoom;
  return BSP_ERROR_NONE;
}

/**
  * @brief  Get the camera zoom
  * @param  Instance Camera instance.
  * @param  Zoom     Zoom to be returned
  * @retval BSP status
  */
int32_t BSP_CAMERA_GetZoom(uint32_t Instance, uint32_t *Zoom)
{
  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    return BSP_ERROR_WRONG_PARAM;
  }

  if (CameraCap->Zoom == 0U)
  {
    return BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }

  *Zoom = CameraCtx[Instance].Zoom;
  return BSP_ERROR_NONE;
}

/**
  * @brief  Enable the camera night mode
  * @param  Instance Camera instance.
  * @retval BSP status
  */
int32_t BSP_CAMERA_EnableNightMode(uint32_t Instance)
{
  int32_t ret;

  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    return BSP_ERROR_WRONG_PARAM;
  }

  if (CameraCap->NightMode == 0U)
  {
    return BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }

  ret = CameraDrv->NightModeConfig(CompObj, CAMERA_NIGHT_MODE_SET);
  if (ret < 0)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  return BSP_ERROR_NONE;
}

/**
  * @brief  Disable the camera night mode
  * @param  Instance Camera instance.
  * @retval BSP status
  */
int32_t BSP_CAMERA_DisableNightMode(uint32_t Instance)
{
  int32_t ret;

  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    return BSP_ERROR_WRONG_PARAM;
  }

  if (CameraCap->NightMode == 0U)
  {
    return BSP_ERROR_FEATURE_NOT_SUPPORTED;
  }

  ret = CameraDrv->NightModeConfig(CompObj, CAMERA_NIGHT_MODE_RESET);
  if (ret < 0)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  return BSP_ERROR_NONE;
}

/**
  * @brief  CAMERA hardware reset
  * @param  Instance Camera instance.
  * @retval BSP status
  */
int32_t BSP_CAMERA_HwReset(uint32_t Instance)
{
  UNUSED(Instance);

  int32_t ret = BSP_ERROR_NONE;
  /* Camera sensor RESET sequence */
  GPIO_InitTypeDef  gpio_init_structure;

  /*** Configure the GPIOs ***/
  CAMERA_STBYN_GPIO_CLK_ENABLE();
  CAMERA_RST_GPIO_CLK_ENABLE();

  gpio_init_structure.Pin = CAMERA_STBYN_PIN;
  gpio_init_structure.Mode = GPIO_MODE_OUTPUT_PP;
  gpio_init_structure.Pull = GPIO_NOPULL;
  gpio_init_structure.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(CAMERA_STBYN_GPIO_PORT, &gpio_init_structure);

  gpio_init_structure.Pin = CAMERA_RST_PIN;
  HAL_GPIO_Init(CAMERA_RST_GPIO_PORT, &gpio_init_structure);

#if defined(USE_CAMERA_SENSOR_OV5640)
#if defined(USE_CSI_INTERFACE)
  HAL_GPIO_WritePin(CAMERA_STBYN_GPIO_PORT, CAMERA_STBYN_PIN, GPIO_PIN_SET);
  HAL_Delay(5);
  HAL_GPIO_WritePin(CAMERA_RST_GPIO_PORT, CAMERA_RST_PIN, GPIO_PIN_SET);
  HAL_Delay(25);
#else
  HAL_GPIO_WritePin(CAMERA_STBYN_GPIO_PORT, CAMERA_STBYN_PIN, GPIO_PIN_RESET);
  HAL_GPIO_WritePin(CAMERA_STBYN_GPIO_PORT, CAMERA_STBYN_PIN, GPIO_PIN_SET);
  HAL_GPIO_WritePin(CAMERA_RST_GPIO_PORT, CAMERA_RST_PIN, GPIO_PIN_SET);
  HAL_Delay(100);
  HAL_GPIO_WritePin(CAMERA_STBYN_GPIO_PORT, CAMERA_STBYN_PIN, GPIO_PIN_RESET);
  HAL_Delay(100);
  HAL_GPIO_WritePin(CAMERA_STBYN_GPIO_PORT, CAMERA_STBYN_PIN, GPIO_PIN_SET);
  HAL_Delay(100);
  HAL_GPIO_WritePin(CAMERA_RST_GPIO_PORT, CAMERA_RST_PIN, GPIO_PIN_RESET);
  HAL_Delay(100);
#endif /* USE_CSI_INTERFACE */
#elif defined(USE_CAMERA_SENSOR_IMX219)
  HAL_GPIO_WritePin(CAMERA_STBYN_GPIO_PORT, CAMERA_STBYN_PIN, GPIO_PIN_RESET);
  HAL_Delay(100);
  HAL_GPIO_WritePin(CAMERA_RST_GPIO_PORT, CAMERA_RST_PIN, GPIO_PIN_RESET);
  HAL_Delay(100);
  HAL_GPIO_WritePin(CAMERA_RST_GPIO_PORT, CAMERA_RST_PIN, GPIO_PIN_SET);
  HAL_Delay(100);
#elif defined(USE_CAMERA_SENSOR_IMX335)
  HAL_GPIO_WritePin(CAMERA_STBYN_GPIO_PORT, CAMERA_STBYN_PIN, GPIO_PIN_RESET);
  HAL_Delay(100);
  HAL_GPIO_WritePin(CAMERA_RST_GPIO_PORT, CAMERA_RST_PIN, GPIO_PIN_RESET);
  HAL_Delay(100);
  HAL_GPIO_WritePin(CAMERA_STBYN_GPIO_PORT, CAMERA_STBYN_PIN, GPIO_PIN_SET);
  HAL_Delay(100);
  HAL_GPIO_WritePin(CAMERA_RST_GPIO_PORT, CAMERA_RST_PIN, GPIO_PIN_SET);
  HAL_Delay(100);
#endif /* USE_CAMERA_SENSOR_OV5640 */

  return ret;
}

/**
  * @}
  */

/** @defgroup CAMERA_Private_Functions Private Functions
  * @{
  */

/**
  * @brief  Get the capture size in pixels unit.
  * @param  Resolution  the current resolution.
  * @retval capture size in pixels unit.
  */
int32_t GetSize(uint32_t Resolution, uint32_t PixelFormat)
{
  uint32_t size = 0;
  uint32_t pf_div;
  if (PixelFormat == CAMERA_PF_RGB888)
  {
    pf_div = 3; /* each pixel on 3 bytes so 3/4 words */
  }
  else
  {
    pf_div = 2; /* each pixel on 2 bytes so 1/2 words*/
  }
  /* Get capture size */
  switch (Resolution)
  {
    case CAMERA_R160x120:
      size = ((uint32_t)(160 * 120) * pf_div);
      break;
    case CAMERA_R320x240:
      size = ((uint32_t)(320 * 240) * pf_div);
      break;
    case CAMERA_R480x272:
      size = ((uint32_t)(480 * 272) * pf_div);
      break;
    case CAMERA_R640x480:
      size = ((uint32_t)(640 * 480) * pf_div);
      break;
    case CAMERA_R800x480:
      size = ((uint32_t)(800 * 480) * pf_div);
      break;
    default:
      break;
  }

  return (int32_t)size;
}

/**
  * @}
  */

/** @addtogroup _CAMERA_Private_FunctionPrototypes
  * @{
  */
/**
  * @brief  Register Bus IOs if component ID is OK
  * @retval error status
  */
/* #warning !!! On FPGA, OV5640 pixel clock must be reduced, ensure to apply patch !!! */
/*
diff --git a/ov5640.c b/ov5640.c
index 42e14ee04497..5e5d0471542d 100644
--- a/ov5640.c
+++ b/ov5640.c
@@ -145,8 +145,8 @@ int32_t OV5640_Init(OV5640_Object_t *pObj, uint32_t Resolution, uint32_t PixelFo
     {OV5640_PAD_OUTPUT_ENABLE02, 0xf3},
     {OV5640_SC_PLL_CONTRL0, 0x18},
     {OV5640_SYSTEM_CTROL0, 0x02},
-    {OV5640_SC_PLL_CONTRL1, 0x41},
-    {OV5640_SC_PLL_CONTRL2, 0x60},
+    {OV5640_SC_PLL_CONTRL1, 0x40},
+    {OV5640_SC_PLL_CONTRL2, 0x04},
     {OV5640_SC_PLL_CONTRL3, 0x13},
     {OV5640_SYSTEM_ROOT_DIVIDER, 0x01},
     {0x3630, 0x36},
 */
#if defined(USE_CAMERA_SENSOR_OV5640)
static int32_t OV5640_Probe(uint32_t Resolution, uint32_t PixelFormat)
{
  int32_t ret;
  OV5640_IO_t              IOCtx;
  uint32_t                  id;

  /* Only perform the init if the object already exist */
  if (!CompObj)
  {
    /* Configure the I2C driver */
    IOCtx.Address     = CAMERA_OV5640_ADDRESS;
    IOCtx.Init        = BSP_I2C2_Init;
    IOCtx.DeInit      = BSP_I2C2_DeInit;
    IOCtx.ReadReg     = BSP_I2C2_ReadReg16;
    IOCtx.WriteReg    = BSP_I2C2_WriteReg16;
    IOCtx.GetTick     = BSP_GetTick;

    ret = OV5640_RegisterBusIO(&OV5640Obj, &IOCtx);
    if (ret != OV5640_OK)
    {
      return BSP_ERROR_COMPONENT_FAILURE;
    }

    ret = OV5640_ReadID(&OV5640Obj, &id);
    if (ret != OV5640_OK)
    {
      return BSP_ERROR_COMPONENT_FAILURE;
    }

